# Intro to Pandas Library

The pandas library consists mostly of two data types:
- Series
- DataFrames: a 2D object to represent `tabular` data

## DataFrames Characteristics
- Mutable
- Index based
- A full class

## Classic data representation formats

- JSON better if data might be missing information
- CSV faster

In [1]:
import pandas as pd

In [2]:
# Create a new dataFrame
df_one = pd.DataFrame(columns=['Column1', 'Column2']) # Adds columns with passed in names
df_one

Empty DataFrame
Columns: [Column1, Column2]
Index: []

In [5]:
# Another way
df_one.columns= ['First', 'Second']
df_one

Empty DataFrame
Columns: [First, Second]
Index: []

In [6]:
# Add some rows
data1 = {
    'First': [1, 2, 'Real'], # key = column, values = list of data
    'Second' : [22, 44, 'Madrid']
}
# Create new df with data
df_two = pd.DataFrame(data1)
df_two

  First  Second
0     1      22
1     2      44
2  Real  Madrid

In [7]:
# Combine two dfs
df_three = pd.concat([df_one, df_two])
df_three

  First  Second
0     1      22
1     2      44
2  Real  Madrid

In [8]:
# add data to df_one
data = {
    'First': [66, 77, 'Hello'],
    'Second': [88, 99, 'CS4580']
}
# Add it to frame
df_one= pd.DataFrame(data)
# Combine them
df_three = pd.concat([df_one, df_two])
df_three

   First  Second
0     66      88
1     77      99
2  Hello  CS4580
0      1      22
1      2      44
2   Real  Madrid

In [10]:
# Update indexes as you combine them
df_three.reset_index(drop=True, inplace=True)
df_three

   First  Second
0     66      88
1     77      99
2  Hello  CS4580
3      1      22
4      2      44
5   Real  Madrid

In [12]:
# Add df colum-wise
col_data = {
    'Third': [88, 99, 11]
}

df_four = pd.DataFrame(col_data)

# No combine them by column
df_combined = pd.concat([df_three, df_four], axis=1)
df_combined

   First  Second  Third
0     66      88   88.0
1     77      99   99.0
2  Hello  CS4580   11.0
3      1      22    NaN
4      2      44    NaN
5   Real  Madrid    NaN

## Task: Sales Data

In [17]:
# TODO: Define a df called df_sales with two columns: Date, Amount
import pandas as pd

df_sales = pd.DataFrame(columns=['Date', 'Amount'])

# TODO: Add sample data 3 rows
sales1 = {
    'Date' : ['10/10/20', '11/11/24', '12/12/24'],
    'Amount': [5.50, 7.30, 8.40]
}

df_sales = pd.DataFrame(sales1)
print(df_sales)

# TODO: Create a new df with two more rows of data, same columns as df_sales

df_sales2 = pd.DataFrame(columns=['Date', 'Amount'])
sales2 = {
    'Date' : ['1/1/20', '2/20/24'],
    'Amount': [1.50, 17.30]
}

df_sales2 = pd.DataFrame(sales2)

#TODO: Combine them, and make sure indexes are correct

df_sales3 = pd.concat([df_sales, df_sales2], ignore_index=True)
print(df_sales3)


# TODO: Add anew column called: 'Product' with 4 rows of data, and combine it it to orginal df_sales
product_data = {
    'Product': ['Apple', 'Pear', 'Pineapple', 'Mustard']
}
df_product_data = pd.DataFrame(product_data)

df_total_data =pd.concat([df_sales3, df_product_data], axis=1)

df_total_data

       Date  Amount
0  10/10/20     5.5
1  11/11/24     7.3
2  12/12/24     8.4
       Date  Amount
0  10/10/20     5.5
1  11/11/24     7.3
2  12/12/24     8.4
3    1/1/20     1.5
4   2/20/24    17.3

       Date  Amount    Product
0  10/10/20     5.5      Apple
1  11/11/24     7.3       Pear
2  12/12/24     8.4  Pineapple
3    1/1/20     1.5    Mustard
4   2/20/24    17.3        NaN

## Working with JSON Files

You can handle JSON files directly with Pandas, using the `read_JSON` method

In [2]:
import pandas as pd

# Load json file
df_json_date = pd.read_json('../data/example-1.json')

In [3]:
# Display df
df_json_date

   Column 1  Column 2
0         1         2
1         3         4
2         5         6

In [4]:
# Convert dataFrame to json formatted string
json_format = df_json_date.to_json()
json_format

'{"Column 1":{"0":1,"1":3,"2":5},"Column 2":{"0":2,"1":4,"2":6}}'

## Working with CSV Files

With Pandas use the `read_CSV` method.

In [5]:
df_csv_format = pd.read_csv('../data/example-1.csv')
# Display it
df_csv_format

     Branch       Date  Amount
0  Branch A  January 1   500.0
1  Branch B  January 2   250.0
2  Branch A  January 3   300.0

In [8]:
# Read file without header record
df_csv_format = pd.read_csv('../data/example-2.csv', header=None)
# Display it
df_csv_format

          0          1      2
0  Branch A  January 1  500.0
1  Branch B  January 2  250.0
2  Branch A  January 3  300.0

In [11]:
# Save the data back to csv file
# if you do not need to index information use, index=None removes row index header=None removes header
df_csv_format.to_csv('test.csv', index=None, header=None)